#Напишите программу, вычисляющую площадь ромба. Пользователь с клавиатуры вводит длину двух его
#диагоналей

a = float(input("Введите одну диагональ ромба: "))
b = float(input("Введите вторую диагональ ромба: "))

print("Площадь ромба= ")
res = a*b/2
print(res)
