# -*- coding: utf-8 -*-
#Есть некоторый текст. Посчитайте в этом тексте количество предложений и выведите на экран полученный результат.

s = """Надо жить, надо любить, надо верить, — говорил Пьер, — что живем не нынче только на этом клочке земли, 
а жили и будем жить вечно там, во всем (он указал на небо). Князь Андрей стоял, облокотившись на перила парома, 
и, слушая Пьера, не спуская глаз, смотрел на красный отблеск солнца по синеющему разливу. Пьер замолк. 
Было совершенно тихо. Паром давно пристал, и только волны течения с слабым звуком ударялись о дно парома. 
Князю Андрею казалось, что это полосканье волн к словам Пьера приговаривало: «Правда, верь этому»."""

l = s.split(". ")
print(len(l))




